# =============================================================
# Напишите программу, которая принимает на вход координаты
# двух точек и находит расстояние между ними в 2D пространстве
# =============================================================

import math

print('Точка A')
xA = int(input('Введите координату Х: '))
yA = int(input('Введите координату Y: '))

print('Точка B')
xB = int(input('Введите координату Х: '))
yB = int(input('Введите координату Y: '))

distance = round(math.sqrt((xA - xB)**2 + (yA - yB)**2),2)

print(f'Расстояние между точками A и B равно {distance}')